Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExtensionLineTypes
The extension line types.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExtensionLineTypes.No
The extension lines are visible.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExtensionLineTypes.Yes
The extension lines of a dimension are not visible.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExtensionLineTypes.NotOnGridlines
The extension lines are not visible when the lines are on a grid.